This returns a column's width in pixels
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public int GetColumnWidthInPixels(
	int nCol
)
  Visual Basic
Public Function GetColumnWidthInPixels ( _
	nCol As Integer _
) As Integer
  Visual C++
public:
int GetColumnWidthInPixels(
	int nCol
)
 Parameters
  nCol
 Type:  System Int32
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   The given column number nCol is invalid.
 See Also
  TableSectionData Class
  Autodesk.Revit.DB Namespace